---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkType.IsFromLocalPath
source: html/ff52a707-e3cc-4b90-d15b-d9db4f52766a.htm
---
# Autodesk.Revit.DB.RevitLinkType.IsFromLocalPath Method

Checks whether the Revit link uses a local path, such as a hard drive.

## Syntax (C#)
```csharp
public bool IsFromLocalPath()
```

## Returns
Returns true if the Revit link is from a local drive.